:MMOSERVER
{		
	AuthPacketCount = 1		// 1프레임동안, 1명의 유저당 몇 개의 패킷을 처리할 것인가
	AuthSleep = 10			// Sleep하는 시간(밀리세컨드)	
	AuthNewUSerPacketCount = 10	// 1프레임동안, Accept Socket Queue에서 빼는 패킷의 수. (즉, 1프레임에 None에서 Auth로 변경되는 유저 수)

	GamePacketCount = 30		// 1프레임에, 1명의 유저당 몇 개의 패킷을 처리할 것인가
	GameSleep = 1			// Sleep하는 시간(밀리세컨드)	
	GameNewUSerPacketCount = 30	// 1프레임 동안, AUTH_TO_GAME에서 GAME으로 변경되는 유저의 수	

	ReleaseSleep = 10			// Sleep하는 시간(밀리세컨드)

	SendSleep = 100			// Sleep하는 시간(밀리세컨드)
	MaxSendThread = 1		// Send Thread 카운트
	
	HeartBeatFlag = 0		// 하트비트 플래그. 1이면 하트비트 체크한다.
}

:BATTLESERVER
{	
	BindIP = "0.0.0.0"		// bind IP
	Port = 11402		// Port	
	CreateWorker = 4		// 생성 워커 스레드
	ActiveWorker = 2		// 활성화 워커스레드
	CreateAccept = 1		// 생성 엑셉트 스레드
	HeadCode = 119		// 헤더 코드
	XorCode = 50		// XorCode
	Nodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	MaxJoinUser = 4000	// 최대 접속 가능 유저 수
	LogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템	
}

:CONFIG
{
	VerCode = 89201739		// 버전 코드. 클라이언트가 들고온다.
	BattleNetServerIP = "192.168.10.114"		// 마스터 서버에게 전달할, 배틀 net 서버의 Ip. 유저들은 이 정보를 보고 들어온다. 
	MasterEnterToken = "12345678901234567890123456789012"	// 마스터 서버에 로그인 시 들고갈 토큰
}

:MASTERLANCLIENT
{
	MasterServerIP = "172.16.1.1"		// 마스터 서버의 IP
	MasterServerPort = 13000		// 마스터 서버의, 배틀 랜 서버쪽 Port
	MasterClientCreateWorker = 1	// 생성 워커 스레드 
	MasterClientActiveWorker = 1	// 활성화 워커 스레드
	MasterClientNodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)	
}

:MONITORLANCLIENT
{
	MonitorServerIP = "222.107.0.122"	// 전달을 위한 모니터링 서버(LanServer)의 IP
	MonitorServerPort = 20060		// 전달을 위한 모니터링 서버(LanServer) Port
	MonitorClientCreateWorker = 1	// 생성 워커 스레드 
	MonitorClientActiveWorker = 1	// 활성화 워커 스레드
	MonitorClientNodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
}

:CHATLANSERVER
{
	ChatBindIP = "10.0.0.2"	// bind IP	
	ChatPort = 13200		// Port	
	ChatCreateWorker = 4		// 생성 워커 스레드
	ChatActiveWorker = 2		// 활성화 워커스레드
	ChatCreateAccept = 1		// 생성 엑셉트 스레드
	ChatNodelay = 0			// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	ChatMaxJoinUser = 5		// 최대 접속 가능 유저 수
	ChatLogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템	
}